<a href="https://colab.research.google.com/github/pasindu-94/solar-power-prediction-multi-inverter/blob/main/solar_forecasting.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Solar Power Prediction and Forecasting Analysis

## Background

Solar power forecasting is the process of gathering and analyzing data in order to predict solar power generation on various time horizons with the goal to mitigate the impact of solar intermittency. Solar power forecasts are used for efficient management of the electric grid and for power trading

In [1]:
#Importing Libraries

import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

##Loading Datasets

In [2]:
solar_plant01_generation_file = 'https://raw.githubusercontent.com/pasindu-94/solar-power-prediction-multi-inverter/main/datasets/solar_plant01_generation_data.csv'
solar_plant01_weather_data_file = 'https://raw.githubusercontent.com/pasindu-94/solar-power-prediction-multi-inverter/main/datasets/solar_plant01_weather_data.csv'
solar_plant02_generation_file = 'https://raw.githubusercontent.com/pasindu-94/solar-power-prediction-multi-inverter/main/datasets/solar_plant02_generation_data.csv'
solar_plant02_weather_data_file = 'https://raw.githubusercontent.com/pasindu-94/solar-power-prediction-multi-inverter/main/datasets/solar_plant02_weather_data.csv'


# Load CSV File
solargen_data01 = pd.read_csv(solar_plant01_generation_file)
weather_data01 = pd.read_csv(solar_plant01_weather_data_file)

solargen_data02 = pd.read_csv(solar_plant02_generation_file)
weather_data02 = pd.read_csv(solar_plant02_weather_data_file)

In [3]:
solargen_data01.head()

          DATE_TIME  PLANT_ID  ... DAILY_YIELD  TOTAL_YIELD
0  15-05-2020 00:00   4135001  ...         0.0    6259559.0
1  15-05-2020 00:00   4135001  ...         0.0    6183645.0
2  15-05-2020 00:00   4135001  ...         0.0    6987759.0
3  15-05-2020 00:00   4135001  ...         0.0    7602960.0
4  15-05-2020 00:00   4135001  ...         0.0    7158964.0

[5 rows x 7 columns]

In [5]:
weather_data01.head()

             DATE_TIME  PLANT_ID  ... MODULE_TEMPERATURE  IRRADIATION
0  2020-05-15 00:00:00   4135001  ...          22.857507          0.0
1  2020-05-15 00:15:00   4135001  ...          22.761668          0.0
2  2020-05-15 00:30:00   4135001  ...          22.592306          0.0
3  2020-05-15 00:45:00   4135001  ...          22.360852          0.0
4  2020-05-15 01:00:00   4135001  ...          22.165423          0.0

[5 rows x 6 columns]

In [4]:
solargen_data02.head()

             DATE_TIME  PLANT_ID  ...  DAILY_YIELD   TOTAL_YIELD
0  2020-05-15 00:00:00   4136001  ...  9425.000000  2.429011e+06
1  2020-05-15 00:00:00   4136001  ...     0.000000  1.215279e+09
2  2020-05-15 00:00:00   4136001  ...  3075.333333  2.247720e+09
3  2020-05-15 00:00:00   4136001  ...   269.933333  1.704250e+06
4  2020-05-15 00:00:00   4136001  ...  3177.000000  1.994153e+07

[5 rows x 7 columns]

In [6]:
weather_data02.head()

             DATE_TIME  PLANT_ID  ... MODULE_TEMPERATURE  IRRADIATION
0  2020-05-15 00:00:00   4136001  ...          25.060789          0.0
1  2020-05-15 00:15:00   4136001  ...          24.421869          0.0
2  2020-05-15 00:30:00   4136001  ...          24.427290          0.0
3  2020-05-15 00:45:00   4136001  ...          24.420678          0.0
4  2020-05-15 01:00:00   4136001  ...          25.088210          0.0

[5 rows x 6 columns]

##Data Set Preprocessing for Analysis

###Solar Plant 01 Generation Data

In [7]:
solargen_data01.shape

(68778, 7)

In [8]:
solargen_data01.describe(include='all').transpose()

             count unique  ...          75%          max
DATE_TIME    68778   3158  ...          NaN          NaN
PLANT_ID     68778    NaN  ...    4.135e+06    4.135e+06
SOURCE_KEY   68778     22  ...          NaN          NaN
DC_POWER     68778    NaN  ...      6366.96      14471.1
AC_POWER     68778    NaN  ...      623.619      1410.95
DAILY_YIELD  68778    NaN  ...         6274         9163
TOTAL_YIELD  68778    NaN  ...  7.26871e+06  7.84682e+06

[7 rows x 11 columns]

In [9]:
#Checking for Null Values
solargen_data01.isnull().sum()

DATE_TIME      0
PLANT_ID       0
SOURCE_KEY     0
DC_POWER       0
AC_POWER       0
DAILY_YIELD    0
TOTAL_YIELD    0
dtype: int64

###Solar Plant 01 Weather Data

In [10]:
weather_data01.shape

(3182, 6)

In [11]:
weather_data01.describe(include='all').transpose()

                    count unique  ...        75%        max
DATE_TIME            3182   3182  ...        NaN        NaN
PLANT_ID             3182    NaN  ...  4.135e+06  4.135e+06
SOURCE_KEY           3182      1  ...        NaN        NaN
AMBIENT_TEMPERATURE  3182    NaN  ...    27.9205    35.2525
MODULE_TEMPERATURE   3182    NaN  ...    41.3078    65.5457
IRRADIATION          3182    NaN  ...   0.449588    1.22165

[6 rows x 11 columns]

In [12]:
#Checking for Null Values
weather_data01.isnull().sum()

DATE_TIME              0
PLANT_ID               0
SOURCE_KEY             0
AMBIENT_TEMPERATURE    0
MODULE_TEMPERATURE     0
IRRADIATION            0
dtype: int64

###Solar Plant 02 Generation Data

In [13]:
solargen_data02.shape

(67698, 7)

In [14]:
solargen_data02.describe(include='all').transpose()

             count unique  ...         75%          max
DATE_TIME    67698   3259  ...         NaN          NaN
PLANT_ID     67698    NaN  ...   4.136e+06    4.136e+06
SOURCE_KEY   67698     22  ...         NaN          NaN
DC_POWER     67698    NaN  ...     446.592      1420.93
AC_POWER     67698    NaN  ...     438.215      1385.42
DAILY_YIELD  67698    NaN  ...        5534         9873
TOTAL_YIELD  67698    NaN  ...  1.3485e+09  2.24792e+09

[7 rows x 11 columns]

In [15]:
#Checking for Null Values
solargen_data02.isnull().sum()

DATE_TIME      0
PLANT_ID       0
SOURCE_KEY     0
DC_POWER       0
AC_POWER       0
DAILY_YIELD    0
TOTAL_YIELD    0
dtype: int64

###Solar Plant 02 Weather Data

In [16]:
weather_data02.shape

(3259, 6)

In [17]:
weather_data02.describe(include='all').transpose()

                    count unique  ...        75%        max
DATE_TIME            3259   3259  ...        NaN        NaN
PLANT_ID             3259    NaN  ...  4.136e+06  4.136e+06
SOURCE_KEY           3259      1  ...        NaN        NaN
AMBIENT_TEMPERATURE  3259    NaN  ...    31.0568    39.1816
MODULE_TEMPERATURE   3259    NaN  ...    40.4807     66.636
IRRADIATION          3259    NaN  ...   0.438717    1.09877

[6 rows x 11 columns]

In [18]:
#Checking for Null Values
weather_data02.isnull().sum()

DATE_TIME              0
PLANT_ID               0
SOURCE_KEY             0
AMBIENT_TEMPERATURE    0
MODULE_TEMPERATURE     0
IRRADIATION            0
dtype: int64